In [9]:
import pandas as pd
import numpy as np

In [10]:
data = pd.read_csv('/home/prashant/Downloads/Puneeth_GM/Superset-UC.csv')

In [11]:
data.head()

   application_id  loan_amount  tenure   roi
0           43812      40000.0       4  28.0
1           52352      24800.0       4  28.0
2           55914      24800.0       4  28.0
3           56360      24800.0       4  28.0
4           56307      40000.0       4  28.0

In [12]:
data['emi'] = data.loan_amount/data.tenure

In [13]:
data.head()

   application_id  loan_amount  tenure   roi      emi
0           43812      40000.0       4  28.0  10000.0
1           52352      24800.0       4  28.0   6200.0
2           55914      24800.0       4  28.0   6200.0
3           56360      24800.0       4  28.0   6200.0
4           56307      40000.0       4  28.0  10000.0

In [4]:
%run '/home/prashant/PycharmProjects/medulla/medulla_utils/finance.py'

In [6]:
# advance_interest_amount_breakup.__code__.co_varnames

In [5]:
get_emi.__code__.co_varnames

('loan_amount',
 'duration_months',
 'interest_rate_pcpa',
 'interest_rate',
 'monthly')

In [6]:
data['emi_calc'] = data.apply(lambda row: get_emi(row['loan_amount'], row['tenure'], row['roi']), axis=1)

In [7]:
data.head()

   application_id  loan_amount  tenure   roi  emi_calc
0           61520      50000.0      24  30.0   2795.64
1           57547      50000.0      24  28.0   2744.42
2           60397      80000.0      24  30.0   4473.03
3           62799      50000.0      24  28.0   2744.42

In [14]:
data.to_csv('/home/prashant/Downloads/Puneeth_GM/EmiCalc_UC.csv')

In [9]:
# dir()